#+TITLE: "How to" in orgmode
#+Author: Brice Ozenne

** From \Rlogo to latex (1/3)

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
library(xtable)
data(tli)
xtable(tli[1:10, ])
#+END_SRC

#+RESULTS:
#+begin_example
% latex table generated in R 4.2.0 by xtable 1.8-4 package
% Wed Mar 12 09:43:06 2025
\begin{table}[ht]
\centering
\begin{tabular}{rrlllr}
  \hline
 & grade & sex & disadvg & ethnicty & tlimth \\ 
  \hline
1 &   6 & M & YES & HISPANIC &  43 \\ 
  2 &   7 & M & NO & BLACK &  88 \\ 
  3 &   5 & F & YES & HISPANIC &  34 \\ 
  4 &   3 & M & YES & HISPANIC &  65 \\ 
  5 &   8 & M & YES & WHITE &  75 \\ 
  6 &   5 & M & NO & BLACK &  74 \\ 
  7 &   8 & F & YES & HISPANIC &  72 \\ 
  8 &   4 & M & YES & BLACK &  79 \\ 
  9 &   6 & M & NO & WHITE &  88 \\ 
  10 &   7 & M & YES & HISPANIC &  87 \\ 
   \hline
\end{tabular}
\end{table}
#+end_example

** From \Rlogo to latex (2/2)

#+BEGIN_SRC R :exports both :results output latex :session *R* :cache no
library(xtable)
data(tli)
xtable(tli[1:10, ])
#+END_SRC

#+RESULTS:
#+begin_export latex
% latex table generated in R 4.2.0 by xtable 1.8-4 package
% Wed Mar 12 09:43:24 2025
\begin{table}[ht]
\centering
\begin{tabular}{rrlllr}
  \hline
 & grade & sex & disadvg & ethnicty & tlimth \\ 
  \hline
1 &   6 & M & YES & HISPANIC &  43 \\ 
  2 &   7 & M & NO & BLACK &  88 \\ 
  3 &   5 & F & YES & HISPANIC &  34 \\ 
  4 &   3 & M & YES & HISPANIC &  65 \\ 
  5 &   8 & M & YES & WHITE &  75 \\ 
  6 &   5 & M & NO & BLACK &  74 \\ 
  7 &   8 & F & YES & HISPANIC &  72 \\ 
  8 &   4 & M & YES & BLACK &  79 \\ 
  9 &   6 & M & NO & WHITE &  88 \\ 
  10 &   7 & M & YES & HISPANIC &  87 \\ 
   \hline
\end{tabular}
\end{table}
#+end_export


